[
  {
    "id": "profile_1",
    "scores": {
      "openness": 80,
      "conscientiousness": 60,
      "extraversion": 70,
      "agreeableness": 50,
      "neuroticism": 30
    },
    "description": "This person is a curious, socially engaged planner who balances adventure with sensible preparation. They actively seek new experiences and aesthetic richness, relishing conversation and connecting with others while keeping most commitments organized—booking essentials and using checklists—yet leaving room for spontaneous detours. They are generally cooperative and considerate, willing to accommodate others but also to voice preferences when necessary. Emotionally, they stay composed under pressure, addressing worries pragmatically and moving on without long-lasting distress. In group situations they often take the initiative to introduce people and arrange shared activities, while privately appreciating time to reflect on new experiences and make practical follow-through plans."
  },
  {
    "id": "profile_2",
    "scores": {
      "openness": 20,
      "conscientiousness": 20,
      "extraversion": 10,
      "agreeableness": 90,
      "neuroticism": 70
    },
    "description": "This person prefers predictable, comfortable environments and approaches life with a caring but low-key presence. They lean toward familiar routines and carefully researched choices rather than adventurous experiments, and they often delay firm plans until closer to the moment, which lets them stay flexible but sometimes creates last-minute pressure. Socially reserved, they favor one-on-one or small-group interactions and are more comfortable listening than leading. They are strongly motivated by concern for others—frequently offering help, smoothing conflicts, and prioritizing inclusive, gentle solutions. At the same time they experience worry and sensitivity: uncertainty can produce tangible anxiety, so they prepare backup plans and rely on trusted companions for reassurance when situations feel unpredictable."
  }
]